MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz8110ca9/thirdparty/pic32cz8110ca9/component/eth.h
/*
 * Component description for ETH
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-10-01T16:25:00Z  */
#ifndef _PIC32CZCA90_ETH_COMPONENT_H_
#define _PIC32CZCA90_ETH_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR ETH                       */
/* ************************************************************************** */

/* -------- ETH_SAB : (ETH Offset: 0x00) (R/W 32) Specific Address Bottom [31:0] Register -------- */
#define ETH_SAB_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SAB) Specific Address Bottom [31:0] Register  Reset Value */

#define ETH_SAB_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_SAB) Specific Address 1 Position */
#define ETH_SAB_ADDR_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_SAB_ADDR_Pos)           /* (ETH_SAB) Specific Address 1 Mask */
#define ETH_SAB_ADDR(value)                   (ETH_SAB_ADDR_Msk & (_UINT32_(value) << ETH_SAB_ADDR_Pos)) /* Assignment of value for ADDR in the ETH_SAB register */
#define ETH_SAB_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_SAB) Register Mask  */


/* -------- ETH_SAT : (ETH Offset: 0x04) (R/W 32) Specific Address Top [47:32] Register -------- */
#define ETH_SAT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SAT) Specific Address Top [47:32] Register  Reset Value */

#define ETH_SAT_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_SAT) Specific Address 1 Position */
#define ETH_SAT_ADDR_Msk                      (_UINT32_(0xFFFF) << ETH_SAT_ADDR_Pos)               /* (ETH_SAT) Specific Address 1 Mask */
#define ETH_SAT_ADDR(value)                   (ETH_SAT_ADDR_Msk & (_UINT32_(value) << ETH_SAT_ADDR_Pos)) /* Assignment of value for ADDR in the ETH_SAT register */
#define ETH_SAT_FLTT_Pos                      _UINT32_(16)                                         /* (ETH_SAT) Filter type Position */
#define ETH_SAT_FLTT_Msk                      (_UINT32_(0x1) << ETH_SAT_FLTT_Pos)                  /* (ETH_SAT) Filter type Mask */
#define ETH_SAT_FLTT(value)                   (ETH_SAT_FLTT_Msk & (_UINT32_(value) << ETH_SAT_FLTT_Pos)) /* Assignment of value for FLTT in the ETH_SAT register */
#define ETH_SAT_FLTBM_Pos                     _UINT32_(24)                                         /* (ETH_SAT) Filter byte mask Position */
#define ETH_SAT_FLTBM_Msk                     (_UINT32_(0x3F) << ETH_SAT_FLTBM_Pos)                /* (ETH_SAT) Filter byte mask Mask */
#define ETH_SAT_FLTBM(value)                  (ETH_SAT_FLTBM_Msk & (_UINT32_(value) << ETH_SAT_FLTBM_Pos)) /* Assignment of value for FLTBM in the ETH_SAT register */
#define ETH_SAT_Msk                           _UINT32_(0x3F01FFFF)                                 /* (ETH_SAT) Register Mask  */


/* -------- ETH_SCRT2CMP0 : (ETH Offset: 0x00) (R/W 32) Screening Type 2 Compare Registers Word 0 -------- */
#define ETH_SCRT2CMP0_RESETVALUE              _UINT32_(0x00)                                       /*  (ETH_SCRT2CMP0) Screening Type 2 Compare Registers Word 0  Reset Value */

#define ETH_SCRT2CMP0_MASK_Pos                _UINT32_(0)                                          /* (ETH_SCRT2CMP0) 2Byte Mask/Compare Value Position */
#define ETH_SCRT2CMP0_MASK_Msk                (_UINT32_(0xFFFF) << ETH_SCRT2CMP0_MASK_Pos)         /* (ETH_SCRT2CMP0) 2Byte Mask/Compare Value Mask */
#define ETH_SCRT2CMP0_MASK(value)             (ETH_SCRT2CMP0_MASK_Msk & (_UINT32_(value) << ETH_SCRT2CMP0_MASK_Pos)) /* Assignment of value for MASK in the ETH_SCRT2CMP0 register */
#define ETH_SCRT2CMP0_CMPVAL_Pos              _UINT32_(16)                                         /* (ETH_SCRT2CMP0) 2Byte Compare Value Position */
#define ETH_SCRT2CMP0_CMPVAL_Msk              (_UINT32_(0xFFFF) << ETH_SCRT2CMP0_CMPVAL_Pos)       /* (ETH_SCRT2CMP0) 2Byte Compare Value Mask */
#define ETH_SCRT2CMP0_CMPVAL(value)           (ETH_SCRT2CMP0_CMPVAL_Msk & (_UINT32_(value) << ETH_SCRT2CMP0_CMPVAL_Pos)) /* Assignment of value for CMPVAL in the ETH_SCRT2CMP0 register */
#define ETH_SCRT2CMP0_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ETH_SCRT2CMP0) Register Mask  */


/* -------- ETH_SCRT2CMP1 : (ETH Offset: 0x04) (R/W 32) Screening Type 2 Compare Registers Word 1 -------- */
#define ETH_SCRT2CMP1_RESETVALUE              _UINT32_(0x00)                                       /*  (ETH_SCRT2CMP1) Screening Type 2 Compare Registers Word 1  Reset Value */

#define ETH_SCRT2CMP1_OFFSVAL_Pos             _UINT32_(0)                                          /* (ETH_SCRT2CMP1) Offset Value Position */
#define ETH_SCRT2CMP1_OFFSVAL_Msk             (_UINT32_(0x7F) << ETH_SCRT2CMP1_OFFSVAL_Pos)        /* (ETH_SCRT2CMP1) Offset Value Mask */
#define ETH_SCRT2CMP1_OFFSVAL(value)          (ETH_SCRT2CMP1_OFFSVAL_Msk & (_UINT32_(value) << ETH_SCRT2CMP1_OFFSVAL_Pos)) /* Assignment of value for OFFSVAL in the ETH_SCRT2CMP1 register */
#define ETH_SCRT2CMP1_OFFSSTRT_Pos            _UINT32_(8)                                          /* (ETH_SCRT2CMP1) Offset Start Position */
#define ETH_SCRT2CMP1_OFFSSTRT_Msk            (_UINT32_(0x3) << ETH_SCRT2CMP1_OFFSSTRT_Pos)        /* (ETH_SCRT2CMP1) Offset Start Mask */
#define ETH_SCRT2CMP1_OFFSSTRT(value)         (ETH_SCRT2CMP1_OFFSSTRT_Msk & (_UINT32_(value) << ETH_SCRT2CMP1_OFFSSTRT_Pos)) /* Assignment of value for OFFSSTRT in the ETH_SCRT2CMP1 register */
#define ETH_SCRT2CMP1_Msk                     _UINT32_(0x0000037F)                                 /* (ETH_SCRT2CMP1) Register Mask  */


/* -------- ETH_CTRLA : (ETH Offset: 0x00) (R/W 32) CTRLA Register -------- */
#define ETH_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_CTRLA) CTRLA Register  Reset Value */

#define ETH_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (ETH_CTRLA) Software Reset Bit Position */
#define ETH_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << ETH_CTRLA_SWRST_Pos)               /* (ETH_CTRLA) Software Reset Bit Mask */
#define ETH_CTRLA_SWRST(value)                (ETH_CTRLA_SWRST_Msk & (_UINT32_(value) << ETH_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the ETH_CTRLA register */
#define ETH_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (ETH_CTRLA) Macro Enable Position */
#define ETH_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << ETH_CTRLA_ENABLE_Pos)              /* (ETH_CTRLA) Macro Enable Mask */
#define ETH_CTRLA_ENABLE(value)               (ETH_CTRLA_ENABLE_Msk & (_UINT32_(value) << ETH_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the ETH_CTRLA register */
#define ETH_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (ETH_CTRLA) Run in standby mode Position */
#define ETH_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << ETH_CTRLA_RUNSTDBY_Pos)            /* (ETH_CTRLA) Run in standby mode Mask */
#define ETH_CTRLA_RUNSTDBY(value)             (ETH_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << ETH_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the ETH_CTRLA register */
#define ETH_CTRLA_Msk                         _UINT32_(0x00000043)                                 /* (ETH_CTRLA) Register Mask  */


