MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz8110ca9/thirdparty/pic32cz8110ca9/component/eth.h
/* ETH register offsets definitions */
#define ETH_SAB_REG_OFST               _UINT32_(0x00)      /* (ETH_SAB) Specific Address Bottom [31:0] Register Offset */
#define ETH_SAT_REG_OFST               _UINT32_(0x04)      /* (ETH_SAT) Specific Address Top [47:32] Register Offset */
#define ETH_SCRT2CMP0_REG_OFST         _UINT32_(0x00)      /* (ETH_SCRT2CMP0) Screening Type 2 Compare Registers Word 0 Offset */
#define ETH_SCRT2CMP1_REG_OFST         _UINT32_(0x04)      /* (ETH_SCRT2CMP1) Screening Type 2 Compare Registers Word 1 Offset */
#define ETH_CTRLA_REG_OFST             _UINT32_(0x00)      /* (ETH_CTRLA) CTRLA Register Offset */
#define ETH_CTRLB_REG_OFST             _UINT32_(0x04)      /* (ETH_CTRLB) CTRLB Register Offset */
#define ETH_EVCTRL_REG_OFST            _UINT32_(0x0C)      /* (ETH_EVCTRL) Event Control Register Offset */
#define ETH_SYNCB_REG_OFST             _UINT32_(0x20)      /* (ETH_SYNCB) Sync Busy Register Offset */
#define ETH_WPCTRL_REG_OFST            _UINT32_(0x30)      /* (ETH_WPCTRL) Write Protection Control Register Offset */
#define ETH_NCR_REG_OFST               _UINT32_(0x1000)    /* (ETH_NCR) Network Control Register Offset */
#define ETH_NCFGR_REG_OFST             _UINT32_(0x1004)    /* (ETH_NCFGR) Network Configuration Register Offset */
#define ETH_NSR_REG_OFST               _UINT32_(0x1008)    /* (ETH_NSR) Network Status Register Offset */
#define ETH_UR_REG_OFST                _UINT32_(0x100C)    /* (ETH_UR) User Register Offset */
#define ETH_DCFGR_REG_OFST             _UINT32_(0x1010)    /* (ETH_DCFGR) DMA Configuration Register Offset */
#define ETH_TSR_REG_OFST               _UINT32_(0x1014)    /* (ETH_TSR) Transmit Status Register Offset */
#define ETH_RBQB_REG_OFST              _UINT32_(0x1018)    /* (ETH_RBQB) Receive Buffer Queue Base Address Offset */
#define ETH_TBQB_REG_OFST              _UINT32_(0x101C)    /* (ETH_TBQB) Transmit Buffer Queue Base Address Offset */
#define ETH_RSR_REG_OFST               _UINT32_(0x1020)    /* (ETH_RSR) Receive Status Register Offset */
#define ETH_ISR_REG_OFST               _UINT32_(0x1024)    /* (ETH_ISR) Interrupt Status Register Offset */
#define ETH_IER_REG_OFST               _UINT32_(0x1028)    /* (ETH_IER) Interrupt Enable Register Offset */
#define ETH_IDR_REG_OFST               _UINT32_(0x102C)    /* (ETH_IDR) Interrupt Disable Register Offset */
#define ETH_IMR_REG_OFST               _UINT32_(0x1030)    /* (ETH_IMR) Interrupt Mask Register Offset */
#define ETH_MAN_REG_OFST               _UINT32_(0x1034)    /* (ETH_MAN) PHY Maintenance Register Offset */
#define ETH_RPQ_REG_OFST               _UINT32_(0x1038)    /* (ETH_RPQ) Received Pause Quantum Register Offset */
#define ETH_TPQ_REG_OFST               _UINT32_(0x103C)    /* (ETH_TPQ) Transmit Pause Quantum Register Offset */
#define ETH_TPSF_REG_OFST              _UINT32_(0x1040)    /* (ETH_TPSF) TX partial store and forward Register Offset */
#define ETH_RPSF_REG_OFST              _UINT32_(0x1044)    /* (ETH_RPSF) RX partial store and forward Register Offset */
#define ETH_RJFML_REG_OFST             _UINT32_(0x1048)    /* (ETH_RJFML) RX Jumbo Frame Max Length Register Offset */
#define ETH_EFIEN_REG_OFST             _UINT32_(0x104C)    /* (ETH_EFIEN) External FIFO Interface Enable Offset */
#define ETH_AXIMP_REG_OFST             _UINT32_(0x1054)    /* (ETH_AXIMP) AXI Max Pipeline Offset */
#define ETH_RSCCTRL_REG_OFST           _UINT32_(0x1058)    /* (ETH_RSCCTRL) Receive side coalescing on queues 1-15 Enable Offset */
#define ETH_INTMOD_REG_OFST            _UINT32_(0x105C)    /* (ETH_INTMOD) Interrupt Moderation Offset */
#define ETH_SYSWT_REG_OFST             _UINT32_(0x1060)    /* (ETH_SYSWT) Sys Wake Time Offset */
#define ETH_HRB_REG_OFST               _UINT32_(0x1080)    /* (ETH_HRB) Hash Register Bottom [31:0] Offset */
#define ETH_HRT_REG_OFST               _UINT32_(0x1084)    /* (ETH_HRT) Hash Register Top [63:32] Offset */
#define ETH_STDM_REG_OFST              _UINT32_(0x10A8)    /* (ETH_STDM) Special Type ID Match N Register Offset */
#define ETH_STDM0_REG_OFST             _UINT32_(0x10A8)    /* (ETH_STDM0) Special Type ID Match N Register Offset */
#define ETH_STDM1_REG_OFST             _UINT32_(0x10AC)    /* (ETH_STDM1) Special Type ID Match N Register Offset */
#define ETH_STDM2_REG_OFST             _UINT32_(0x10B0)    /* (ETH_STDM2) Special Type ID Match N Register Offset */
#define ETH_STDM3_REG_OFST             _UINT32_(0x10B4)    /* (ETH_STDM3) Special Type ID Match N Register Offset */
#define ETH_WOL_REG_OFST               _UINT32_(0x10B8)    /* (ETH_WOL) Wake on LAN Offset */
#define ETH_IPGS_REG_OFST              _UINT32_(0x10BC)    /* (ETH_IPGS) IPG Stretch Register Offset */
#define ETH_SVLAN_REG_OFST             _UINT32_(0x10C0)    /* (ETH_SVLAN) Stacked VLAN Register Offset */
#define ETH_TPFCP_REG_OFST             _UINT32_(0x10C4)    /* (ETH_TPFCP) Transmit PFC Pause Register Offset */
#define ETH_SAMB1_REG_OFST             _UINT32_(0x10C8)    /* (ETH_SAMB1) Specific Address 1 Mask Bottom [31:0] Register Offset */
#define ETH_SAMT1_REG_OFST             _UINT32_(0x10CC)    /* (ETH_SAMT1) Specific Address 1 Mask Top [47:32] Register Offset */
#define ETH_DMAAM_REG_OFST             _UINT32_(0x10D0)    /* (ETH_DMAAM) Receive DMA Data Buffer Address Mask Offset */
#define ETH_PTPRXUC_REG_OFST           _UINT32_(0x10D4)    /* (ETH_PTPRXUC) PTP RX unicast IP destination address Offset */
#define ETH_PTPTXUC_REG_OFST           _UINT32_(0x10D8)    /* (ETH_PTPTXUC) PTP TX unicast IP destination address Offset */
#define ETH_NSC_REG_OFST               _UINT32_(0x10DC)    /* (ETH_NSC) Tsu timer comparison nanoseconds Register Offset */
#define ETH_SCL_REG_OFST               _UINT32_(0x10E0)    /* (ETH_SCL) Tsu timer second comparison Register Offset */
#define ETH_SCH_REG_OFST               _UINT32_(0x10E4)    /* (ETH_SCH) Tsu timer second comparison Register Offset */
#define ETH_EFTSH_REG_OFST             _UINT32_(0x10E8)    /* (ETH_EFTSH) PTP Event Frame Transmitted Seconds High Register Offset */
#define ETH_EFRSH_REG_OFST             _UINT32_(0x10EC)    /* (ETH_EFRSH) PTP Event Frame Received Seconds High Register Offset */
#define ETH_PEFTSH_REG_OFST            _UINT32_(0x10F0)    /* (ETH_PEFTSH) PTP Peer Event Frame Transmitted Seconds High Register Offset */
#define ETH_PEFRSH_REG_OFST            _UINT32_(0x10F4)    /* (ETH_PEFRSH) PTP Peer Event Frame Received Seconds High Register Offset */
#define ETH_DPRAMFD_REG_OFST           _UINT32_(0x10F8)    /* (ETH_DPRAMFD) TX and RX packet buffer fill levels Offset */
#define ETH_REVREG_REG_OFST            _UINT32_(0x10FC)    /* (ETH_REVREG) TX and RX packet buffer fill levels Offset */
#define ETH_OTLO_REG_OFST              _UINT32_(0x1100)    /* (ETH_OTLO) Octets Transmitted [31:0] Register Offset */
#define ETH_OTHI_REG_OFST              _UINT32_(0x1104)    /* (ETH_OTHI) Octets Transmitted [47:32] Register Offset */
#define ETH_FT_REG_OFST                _UINT32_(0x1108)    /* (ETH_FT) Frames Transmitted Register Offset */
#define ETH_BCFT_REG_OFST              _UINT32_(0x110C)    /* (ETH_BCFT) Broadcast Frames Transmitted Register Offset */
#define ETH_MFT_REG_OFST               _UINT32_(0x1110)    /* (ETH_MFT) Multicast Frames Transmitted Register Offset */
#define ETH_PFT_REG_OFST               _UINT32_(0x1114)    /* (ETH_PFT) Pause Frames Transmitted Register Offset */
#define ETH_BFT64_REG_OFST             _UINT32_(0x1118)    /* (ETH_BFT64) 64 Byte Frames Transmitted Register Offset */
#define ETH_TBFT127_REG_OFST           _UINT32_(0x111C)    /* (ETH_TBFT127) 65 to 127 Byte Frames Transmitted Register Offset */
#define ETH_TBFT255_REG_OFST           _UINT32_(0x1120)    /* (ETH_TBFT255) 128 to 255 Byte Frames Transmitted Register Offset */
#define ETH_TBFT511_REG_OFST           _UINT32_(0x1124)    /* (ETH_TBFT511) 256 to 511 Byte Frames Transmitted Register Offset */
#define ETH_TBFT1023_REG_OFST          _UINT32_(0x1128)    /* (ETH_TBFT1023) 512 to 1023 Byte Frames Transmitted Register Offset */
#define ETH_TBFT1518_REG_OFST          _UINT32_(0x112C)    /* (ETH_TBFT1518) 1024 to 1518 Byte Frames Transmitted Register Offset */
#define ETH_GTBFT1518_REG_OFST         _UINT32_(0x1130)    /* (ETH_GTBFT1518) Greater Than 1518 Byte Frames Transmitted Register Offset */
#define ETH_TUR_REG_OFST               _UINT32_(0x1134)    /* (ETH_TUR) Transmit Underruns Register Offset */
#define ETH_SCF_REG_OFST               _UINT32_(0x1138)    /* (ETH_SCF) Single Collision Frames Register Offset */
#define ETH_MCF_REG_OFST               _UINT32_(0x113C)    /* (ETH_MCF) Multiple Collision Frames Register Offset */
#define ETH_EC_REG_OFST                _UINT32_(0x1140)    /* (ETH_EC) Excessive Collisions Register Offset */
#define ETH_LC_REG_OFST                _UINT32_(0x1144)    /* (ETH_LC) Late Collisions Register Offset */
#define ETH_DTF_REG_OFST               _UINT32_(0x1148)    /* (ETH_DTF) Deferred Transmission Frames Register Offset */
#define ETH_CSE_REG_OFST               _UINT32_(0x114C)    /* (ETH_CSE) Carrier Sense Errors Register Offset */
#define ETH_ORLO_REG_OFST              _UINT32_(0x1150)    /* (ETH_ORLO) Octets Received [31:0] Received Offset */
#define ETH_ORHI_REG_OFST              _UINT32_(0x1154)    /* (ETH_ORHI) Octets Received [47:32] Received Offset */
#define ETH_FR_REG_OFST                _UINT32_(0x1158)    /* (ETH_FR) Frames Received Register Offset */
#define ETH_BCFR_REG_OFST              _UINT32_(0x115C)    /* (ETH_BCFR) Broadcast Frames Received Register Offset */
#define ETH_MFR_REG_OFST               _UINT32_(0x1160)    /* (ETH_MFR) Multicast Frames Received Register Offset */
#define ETH_PFR_REG_OFST               _UINT32_(0x1164)    /* (ETH_PFR) Pause Frames Received Register Offset */
#define ETH_BFR64_REG_OFST             _UINT32_(0x1168)    /* (ETH_BFR64) 64 Byte Frames Received Register Offset */
#define ETH_TBFR127_REG_OFST           _UINT32_(0x116C)    /* (ETH_TBFR127) 65 to 127 Byte Frames Received Register Offset */
#define ETH_TBFR255_REG_OFST           _UINT32_(0x1170)    /* (ETH_TBFR255) 128 to 255 Byte Frames Received Register Offset */
#define ETH_TBFR511_REG_OFST           _UINT32_(0x1174)    /* (ETH_TBFR511) 256 to 511Byte Frames Received Register Offset */
#define ETH_TBFR1023_REG_OFST          _UINT32_(0x1178)    /* (ETH_TBFR1023) 512 to 1023 Byte Frames Received Register Offset */
#define ETH_TBFR1518_REG_OFST          _UINT32_(0x117C)    /* (ETH_TBFR1518) 1024 to 1518 Byte Frames Received Register Offset */
#define ETH_TMXBFR_REG_OFST            _UINT32_(0x1180)    /* (ETH_TMXBFR) 1519 to Maximum Byte Frames Received Register Offset */
#define ETH_UFR_REG_OFST               _UINT32_(0x1184)    /* (ETH_UFR) Undersize Frames Received Register Offset */
#define ETH_OFR_REG_OFST               _UINT32_(0x1188)    /* (ETH_OFR) Oversize Frames Received Register Offset */
#define ETH_JR_REG_OFST                _UINT32_(0x118C)    /* (ETH_JR) Jabbers Received Register Offset */
#define ETH_FCSE_REG_OFST              _UINT32_(0x1190)    /* (ETH_FCSE) Frame Check Sequence Errors Register Offset */
#define ETH_LFFE_REG_OFST              _UINT32_(0x1194)    /* (ETH_LFFE) Length Field Frame Errors Register Offset */
#define ETH_RSE_REG_OFST               _UINT32_(0x1198)    /* (ETH_RSE) Receive Symbol Errors Register Offset */
#define ETH_AE_REG_OFST                _UINT32_(0x119C)    /* (ETH_AE) Alignment Errors Register Offset */
#define ETH_RRE_REG_OFST               _UINT32_(0x11A0)    /* (ETH_RRE) Receive Resource Errors Register Offset */
#define ETH_ROE_REG_OFST               _UINT32_(0x11A4)    /* (ETH_ROE) Receive Overrun Register Offset */
#define ETH_IHCE_REG_OFST              _UINT32_(0x11A8)    /* (ETH_IHCE) IP Header Checksum Errors Register Offset */
#define ETH_TCE_REG_OFST               _UINT32_(0x11AC)    /* (ETH_TCE) TCP Checksum Errors Register Offset */
#define ETH_UCE_REG_OFST               _UINT32_(0x11B0)    /* (ETH_UCE) UDP Checksum Errors Register Offset */
#define ETH_AFP_REG_OFST               _UINT32_(0x11B4)    /* (ETH_AFP) UDP Checksum Errors Register Offset */
#define ETH_TISUBN_REG_OFST            _UINT32_(0x11BC)    /* (ETH_TISUBN) 1588 Timer Increment [15:0] Sub-Nanoseconds Register Offset */
#define ETH_TSH_REG_OFST               _UINT32_(0x11C0)    /* (ETH_TSH) 1588 Timer Seconds Register 47:32 Offset */
#define ETH_TSSSH_REG_OFST             _UINT32_(0x11C4)    /* (ETH_TSSSH) 1588 Timer Sync Strobe Seconds Register 47:32 Offset */
#define ETH_TSSSL_REG_OFST             _UINT32_(0x11C8)    /* (ETH_TSSSL) 1588 Timer Sync Strobe Seconds [31:0] Register Offset */
#define ETH_TSSN_REG_OFST              _UINT32_(0x11CC)    /* (ETH_TSSN) 1588 Timer Sync Strobe Nanoseconds Register Offset */
#define ETH_TSL_REG_OFST               _UINT32_(0x11D0)    /* (ETH_TSL) 1588 Timer Seconds [31:0] Register Offset */
#define ETH_TN_REG_OFST                _UINT32_(0x11D4)    /* (ETH_TN) 1588 Timer Nanoseconds Register Offset */
#define ETH_TA_REG_OFST                _UINT32_(0x11D8)    /* (ETH_TA) 1588 Timer Adjust Register Offset */
#define ETH_TI_REG_OFST                _UINT32_(0x11DC)    /* (ETH_TI) 1588 Timer Increment Register Offset */
#define ETH_EFTSL_REG_OFST             _UINT32_(0x11E0)    /* (ETH_EFTSL) PTP Event Frame Transmitted Seconds Low Register Offset */
#define ETH_EFTN_REG_OFST              _UINT32_(0x11E4)    /* (ETH_EFTN) PTP Event Frame Transmitted Nanoseconds Offset */
#define ETH_EFRSL_REG_OFST             _UINT32_(0x11E8)    /* (ETH_EFRSL) PTP Event Frame Received Seconds Low Register Offset */
#define ETH_EFRN_REG_OFST              _UINT32_(0x11EC)    /* (ETH_EFRN) PTP Event Frame Received Nanoseconds Offset */
#define ETH_PEFTSL_REG_OFST            _UINT32_(0x11F0)    /* (ETH_PEFTSL) PTP Peer Event Frame Transmitted Seconds Low Register Offset */
#define ETH_PEFTN_REG_OFST             _UINT32_(0x11F4)    /* (ETH_PEFTN) PTP Peer Event Frame Transmitted Nanoseconds Offset */
#define ETH_PEFRSL_REG_OFST            _UINT32_(0x11F8)    /* (ETH_PEFRSL) PTP Peer Event Frame Received Seconds Low Register Offset */
#define ETH_PEFRN_REG_OFST             _UINT32_(0x11FC)    /* (ETH_PEFRN) PTP Peer Event Frame Received Nanoseconds Offset */
#define ETH_TPQ1_REG_OFST              _UINT32_(0x1260)    /* (ETH_TPQ1) Transmit Pause Quantum Register 1 Offset */
#define ETH_TPQ2_REG_OFST              _UINT32_(0x1264)    /* (ETH_TPQ2) Transmit Pause Quantum Register 2 Offset */
#define ETH_TPQ3_REG_OFST              _UINT32_(0x1268)    /* (ETH_TPQ3) Transmit Pause Quantum Register 3 Offset */
#define ETH_RLPITR_REG_OFST            _UINT32_(0x1270)    /* (ETH_RLPITR) Receive LPI transition Register Offset */
#define ETH_RLPITI_REG_OFST            _UINT32_(0x1274)    /* (ETH_RLPITI) Receive LPI Time Register Offset */
#define ETH_TLPITR_REG_OFST            _UINT32_(0x1278)    /* (ETH_TLPITR) Receive LPI transition Register Offset */
#define ETH_TLPITI_REG_OFST            _UINT32_(0x127C)    /* (ETH_TLPITI) Receive LPI Time Register Offset */
#define ETH_DSNCFGDBG_REG_OFST         _UINT32_(0x1280)    /* (ETH_DSNCFGDBG) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG0_REG_OFST        _UINT32_(0x1280)    /* (ETH_DSNCFGDBG0) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG1_REG_OFST        _UINT32_(0x1284)    /* (ETH_DSNCFGDBG1) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG2_REG_OFST        _UINT32_(0x1288)    /* (ETH_DSNCFGDBG2) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG3_REG_OFST        _UINT32_(0x128C)    /* (ETH_DSNCFGDBG3) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG4_REG_OFST        _UINT32_(0x1290)    /* (ETH_DSNCFGDBG4) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG5_REG_OFST        _UINT32_(0x1294)    /* (ETH_DSNCFGDBG5) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG6_REG_OFST        _UINT32_(0x1298)    /* (ETH_DSNCFGDBG6) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG7_REG_OFST        _UINT32_(0x129C)    /* (ETH_DSNCFGDBG7) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG8_REG_OFST        _UINT32_(0x12A0)    /* (ETH_DSNCFGDBG8) Design Configuration Debug Offset */
#define ETH_DSNCFGDBG9_REG_OFST        _UINT32_(0x12A4)    /* (ETH_DSNCFGDBG9) Design Configuration Debug Offset */
#define ETH_ISRQ_REG_OFST              _UINT32_(0x1400)    /* (ETH_ISRQ) Interrupt Status Register Queues Offset */
#define ETH_ISRQ0_REG_OFST             _UINT32_(0x1400)    /* (ETH_ISRQ0) Interrupt Status Register Queues Offset */
#define ETH_ISRQ1_REG_OFST             _UINT32_(0x1404)    /* (ETH_ISRQ1) Interrupt Status Register Queues Offset */
#define ETH_ISRQ2_REG_OFST             _UINT32_(0x1408)    /* (ETH_ISRQ2) Interrupt Status Register Queues Offset */
#define ETH_ISRQ3_REG_OFST             _UINT32_(0x140C)    /* (ETH_ISRQ3) Interrupt Status Register Queues Offset */
#define ETH_ISRQ4_REG_OFST             _UINT32_(0x1410)    /* (ETH_ISRQ4) Interrupt Status Register Queues Offset */
#define ETH_ISRQ5_REG_OFST             _UINT32_(0x1414)    /* (ETH_ISRQ5) Interrupt Status Register Queues Offset */
#define ETH_ISRQ6_REG_OFST             _UINT32_(0x1418)    /* (ETH_ISRQ6) Interrupt Status Register Queues Offset */
#define ETH_ISRQ7_REG_OFST             _UINT32_(0x141C)    /* (ETH_ISRQ7) Interrupt Status Register Queues Offset */
#define ETH_ISRQ8_REG_OFST             _UINT32_(0x1420)    /* (ETH_ISRQ8) Interrupt Status Register Queues Offset */
#define ETH_ISRQ9_REG_OFST             _UINT32_(0x1424)    /* (ETH_ISRQ9) Interrupt Status Register Queues Offset */
#define ETH_ISRQ10_REG_OFST            _UINT32_(0x1428)    /* (ETH_ISRQ10) Interrupt Status Register Queues Offset */
#define ETH_ISRQ11_REG_OFST            _UINT32_(0x142C)    /* (ETH_ISRQ11) Interrupt Status Register Queues Offset */
#define ETH_ISRQ12_REG_OFST            _UINT32_(0x1430)    /* (ETH_ISRQ12) Interrupt Status Register Queues Offset */
#define ETH_ISRQ13_REG_OFST            _UINT32_(0x1434)    /* (ETH_ISRQ13) Interrupt Status Register Queues Offset */
#define ETH_ISRQ14_REG_OFST            _UINT32_(0x1438)    /* (ETH_ISRQ14) Interrupt Status Register Queues Offset */
#define ETH_TBPQB_REG_OFST             _UINT32_(0x1440)    /* (ETH_TBPQB) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB0_REG_OFST            _UINT32_(0x1440)    /* (ETH_TBPQB0) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB1_REG_OFST            _UINT32_(0x1444)    /* (ETH_TBPQB1) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB2_REG_OFST            _UINT32_(0x1448)    /* (ETH_TBPQB2) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB3_REG_OFST            _UINT32_(0x144C)    /* (ETH_TBPQB3) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB4_REG_OFST            _UINT32_(0x1450)    /* (ETH_TBPQB4) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB5_REG_OFST            _UINT32_(0x1454)    /* (ETH_TBPQB5) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB6_REG_OFST            _UINT32_(0x1458)    /* (ETH_TBPQB6) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB7_REG_OFST            _UINT32_(0x145C)    /* (ETH_TBPQB7) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB8_REG_OFST            _UINT32_(0x1460)    /* (ETH_TBPQB8) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB9_REG_OFST            _UINT32_(0x1464)    /* (ETH_TBPQB9) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB10_REG_OFST           _UINT32_(0x1468)    /* (ETH_TBPQB10) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB11_REG_OFST           _UINT32_(0x146C)    /* (ETH_TBPQB11) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB12_REG_OFST           _UINT32_(0x1470)    /* (ETH_TBPQB12) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB13_REG_OFST           _UINT32_(0x1474)    /* (ETH_TBPQB13) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_TBPQB14_REG_OFST           _UINT32_(0x1478)    /* (ETH_TBPQB14) Transmit Priority Queue Buffer Base Address Offset */
#define ETH_RBPQB_REG_OFST             _UINT32_(0x1480)    /* (ETH_RBPQB) Receive Priority Queue Buffer Base Address Offset */
#define ETH_RBPQB0_REG_OFST            _UINT32_(0x1480)    /* (ETH_RBPQB0) Receive Priority Queue Buffer Base Address Offset */
#define ETH_RBPQB1_REG_OFST            _UINT32_(0x1484)    /* (ETH_RBPQB1) Receive Priority Queue Buffer Base Address Offset */
#define ETH_RBPQB2_REG_OFST            _UINT32_(0x1488)    /* (ETH_RBPQB2) Receive Priority Queue Buffer Base Address Offset */
#define ETH_RBPQB3_REG_OFST            _UINT32_(0x148C)    /* (ETH_RBPQB3) Receive Priority Queue Buffer Base Address Offset */
#define ETH_RBPQB4_REG_OFST            _UINT32_(0x1490)    /* (ETH_RBPQB4) Receive Priority Queue Buffer Base Address Offset */
#define ETH_RBPQB5_REG_OFST            _UINT32_(0x1494)    /* (ETH_RBPQB5) Receive Priority Queue Buffer Base Address Offset */
#define ETH_RBPQB6_REG_OFST            _UINT32_(0x1498)    /* (ETH_RBPQB6) Receive Priority Queue Buffer Base Address Offset */
#define ETH_RBQSZ_REG_OFST             _UINT32_(0x14A0)    /* (ETH_RBQSZ) Receive Priority Queue Buffer Size Offset */
#define ETH_RBQSZ0_REG_OFST            _UINT32_(0x14A0)    /* (ETH_RBQSZ0) Receive Priority Queue Buffer Size Offset */
#define ETH_RBQSZ1_REG_OFST            _UINT32_(0x14A4)    /* (ETH_RBQSZ1) Receive Priority Queue Buffer Size Offset */
#define ETH_RBQSZ2_REG_OFST            _UINT32_(0x14A8)    /* (ETH_RBQSZ2) Receive Priority Queue Buffer Size Offset */
#define ETH_RBQSZ3_REG_OFST            _UINT32_(0x14AC)    /* (ETH_RBQSZ3) Receive Priority Queue Buffer Size Offset */
#define ETH_RBQSZ4_REG_OFST            _UINT32_(0x14B0)    /* (ETH_RBQSZ4) Receive Priority Queue Buffer Size Offset */
#define ETH_RBQSZ5_REG_OFST            _UINT32_(0x14B4)    /* (ETH_RBQSZ5) Receive Priority Queue Buffer Size Offset */
#define ETH_RBQSZ6_REG_OFST            _UINT32_(0x14B8)    /* (ETH_RBQSZ6) Receive Priority Queue Buffer Size Offset */
#define ETH_CBSCTRL_REG_OFST           _UINT32_(0x14BC)    /* (ETH_CBSCTRL) CBS Control Register Offset */
#define ETH_CBSISQA_REG_OFST           _UINT32_(0x14C0)    /* (ETH_CBSISQA) IdleSlope value for queue A Offset */
#define ETH_CBSISQB_REG_OFST           _UINT32_(0x14C4)    /* (ETH_CBSISQB) IdleSlope value for queue B Offset */
#define ETH_UTXQBA_REG_OFST            _UINT32_(0x14C8)    /* (ETH_UTXQBA) Upper 32 bits of transmit buffer descriptor queue base address Offset */
#define ETH_TXBDCTRL_REG_OFST          _UINT32_(0x14CC)    /* (ETH_TXBDCTRL) TX BD control register Offset */
#define ETH_RXBDCTRL_REG_OFST          _UINT32_(0x14D0)    /* (ETH_RXBDCTRL) RX BD control register Offset */
#define ETH_URXQBA_REG_OFST            _UINT32_(0x14D4)    /* (ETH_URXQBA) Upper 32 bits of receive buffer descriptor queue base address Offset */
#define ETH_SCRT1_REG_OFST             _UINT32_(0x1500)    /* (ETH_SCRT1) Screening Type 1 Register N Offset */
#define ETH_SCRT1_0_REG_OFST           _UINT32_(0x1500)    /* (ETH_SCRT1_0) Screening Type 1 Register N Offset */
#define ETH_SCRT1_1_REG_OFST           _UINT32_(0x1504)    /* (ETH_SCRT1_1) Screening Type 1 Register N Offset */
#define ETH_SCRT1_2_REG_OFST           _UINT32_(0x1508)    /* (ETH_SCRT1_2) Screening Type 1 Register N Offset */
#define ETH_SCRT1_3_REG_OFST           _UINT32_(0x150C)    /* (ETH_SCRT1_3) Screening Type 1 Register N Offset */
#define ETH_SCRT1_4_REG_OFST           _UINT32_(0x1510)    /* (ETH_SCRT1_4) Screening Type 1 Register N Offset */
#define ETH_SCRT1_5_REG_OFST           _UINT32_(0x1514)    /* (ETH_SCRT1_5) Screening Type 1 Register N Offset */
